#include <iostream>
// AlexandrovichIvan2005
// 0041 006C 0065 006B 0073 0061 006E 0064 0072 006F 0076 0069 0063 0068 0049 0076 0061 006E 0032 0030 0030 0035
// 4c 75 7a 68 65 74 73 6b 69 55 6c 61 64 7a 69 73 6c 61 75 32 30 30 35
// 4c 00 75 00 7a 00 68 00 65 00 74 00 73 00 6b 00 69 00 55 00 6c 00 61 00 64 00 7a 00 69 00 73 00 6c 00 61 00 75 00 32 00 30 00 30 00 35 00


// АлексндровичИван2005
// 0420 043B 0435 043A 0441 0430 043D 0434 0440 043E 0432 0438 0447 0418 0432 0430 043D 0032 0030 0030 0035
// cb f3 e6 e5 f6 ea e8 e9 c2 eb e0 e4 e8 f1 eb e0 e2 32 30 30 35
// 1b 04 43 04 36 04 35 04 46 04 3a 04 38 04 39 04 12 04 3b 04 30 04 34 04 38 04 41 04 3b 04 30 04 32 04 32


// Александрович2005Ivan
// 0420 043B 0435 043A 0441 0430 043D 0434 0440 043E 0432 0438 0447 0063 0032 0030 0030 0035 0049 0076 0061 006E
// cb f3 e6 e5 f6 ea e8 e9 32 30 30 35 55 6c 61 64 7a 69 73 6c 61 75
// 1b 04 43 04 36 04 35 04 46 04 3a 04 38 04 39 04 32 00 30 00 30 00 35 00 55 00 6c 00 61 00 64 00 7a 00 69 00 73 00 6c 00 61 00 75 00 



int main() {
	setlocale(LC_CTYPE, "Russian");
	int number = 0x12345678;
    char hello[] = "Hello, ";
	char lfie[] = "AlexandrovichIvan2005"; 
	char rfie[] = "АлександровичИван2005"; 
	char lr[] = "Александрович2005Ivan"; 

	wchar_t Lfie[] = L"AlexandrovichIvan2005"; 
	wchar_t Rfie[] = L"АлександровичИван2005"; 
	wchar_t LR[] = L"Александрович2005Ivan"; 

	std::cout << hello << lfie << std::endl;
	return 0;

}